Project/Toir/src/Catalogs/гкс_ТехническиеМеста/гкс_ТехническиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТехническиеМеста</name>
  <attributes>
    <name>МестоПлощадка</name>
    <type>
      <types>CatalogRef.гкс_МестаИПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводПодразделение</name>
    <type>
      <types>CatalogRef.гкс_ЗаводыИПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.гкс_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Эстакада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.гкс_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отметка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/гкс_ТехническиеМеста/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр = Истина Тогда 
		Элементы.ФормаКоманднаяПанель.Доступность = Ложь;
		Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
		Элементы.МестоПлощадка.ТолькоПросмотр = Истина;
		Элементы.ЗаводПодразделение.ТолькоПросмотр = Истина;
		Элементы.Участок.ТолькоПросмотр = Истина;
		Элементы.Эстакада.ТолькоПросмотр = Истина;
		Элементы.Секция.ТолькоПросмотр = Истина;
		Элементы.Здание.ТолькоПросмотр = Истина;
		Элементы.Этаж.ТолькоПросмотр = Истина;
		Элементы.Отметка.ТолькоПросмотр = Истина;
		Элементы.МестоПлощадка.КнопкаОткрытия = Ложь;
		Элементы.ЗаводПодразделение.КнопкаОткрытия = Ложь;
		Элементы.Участок.КнопкаОткрытия = Ложь;
		Элементы.Здание.КнопкаОткрытия = Ложь;
	КонецЕсли;
	дс_ПриСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МестоПлощадкаПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименование()
	Объект.НаименованиеПолное = "";
	Если ЗначениеЗаполнено(Объект.МестоПлощадка) Тогда 
		Объект.НаименованиеПолное = Объект.МестоПлощадка;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЗаводПодразделение) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.ЗаводПодразделение;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Участок) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.Участок;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Эстакада) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", эстакада " + Объект.Эстакада;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Секция) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", опора " + Объект.Секция;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Здание) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", здание " + Объект.Здание;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Этаж) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", этаж " + Объект.Этаж;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Отметка) Тогда 
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка "
		+ Формат(Объект.Отметка, "ЧДЦ=3");
	Иначе
		Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка 0,000";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаводПодразделениеПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ЭстакадаПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СекцияПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	ИзменитьНаименование();
КонецПроцедуры

#КонецОбласти

#Область Локализация

&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура дс_ПриСозданииНаСервере()
	//СтроковыеРеквизиты = "НаименованиеПолное";
	//торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);
КонецПроцедуры 

&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи)
	//торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОпОп = Новый Структура();
	ОпОп = Новый ОписаниеОповещения("ОбновитьПослеЗакрытияФормы",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Справочник.гкс_Здания.ФормаОбъекта",Новый Структура("ОткрытИзТК,Ключ",Истина,Объект.Здание),,,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПослеЗакрытияФормы(Результат, ДопПараметры)Экспорт
	ИзменитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура МестоПлощадкаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОпОп = Новый Структура();
	ОпОп = Новый ОписаниеОповещения("ОбновитьПослеЗакрытияФормы",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Справочник.гкс_МестаИПлощадки.ФормаОбъекта",Новый Структура("ОткрытИзТК,Ключ",Истина,Объект.МестоПлощадка),,,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаводПодразделениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОпОп = Новый Структура();
	ОпОп = Новый ОписаниеОповещения("ОбновитьПослеЗакрытияФормы",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Справочник.гкс_ЗаводыИПодразделения.ФормаОбъекта",Новый Структура("ОткрытИзТК,Ключ",Истина,Объект.ЗаводПодразделение),,,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УчастокОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОпОп = Новый Структура();
	ОпОп = Новый ОписаниеОповещения("ОбновитьПослеЗакрытияФормы",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Справочник.гкс_Участки.ФормаОбъекта",Новый Структура("ОткрытИзТК,Ключ",Истина,Объект.Участок),,,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти
